In [47]:
import numpy as np
import pandas as pd

### Вычисления с помощью Numpy

#1

In [48]:
arr = np.array([[1,6], [2,8] ,[3,11], [3,10], [1,7]])
mean_a = arr.mean(axis=0)
mean_a

array([2. , 8.4])

#2

In [64]:
a_centered = np.subtract(arr,mean_a)
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#3

In [50]:
arr_centered_trans = a_centered.transpose()
a_centered_sp = arr_centered_trans[0].dot(arr_centered_trans[1])
a_centered_sp/(arr.shape[0]-1)

2.0

#4

In [51]:
np.cov(arr.transpose())[0][1]

2.0

### Работа с данными в Pandas

#1

In [52]:
authors = pd.DataFrame({"author_id": [1, 2, 3],"author_name":['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [53]:
book = pd.DataFrame({"author_id": [1, 1, 1, 2, 2, 3, 3],"book_title":['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],

})
# не нашел в задаче, сгенерировал сам
book["price"] = np.random.randint(300,900,7)
book

   author_id            book_title  price
0          1           Отцы и дети    731
1          1                 Рудин    429
2          1     Дворянское гнездо    889
3          2      Толстый и тонкий    615
4          2       Дама с собачкой    459
5          3                 Гроза    798
6          3  Таланты и поклонники    388

#2

In [54]:
authors_price = pd.merge(authors,book,how="outer",on="author_id")
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    731
1          1    Тургенев                 Рудин    429
2          1    Тургенев     Дворянское гнездо    889
3          2       Чехов      Толстый и тонкий    615
4          2       Чехов       Дама с собачкой    459
5          3  Островский                 Гроза    798
6          3  Островский  Таланты и поклонники    388

#3

In [55]:
top5 = authors_price.sort_values(by="price",ascending= False).head(5)
top5

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    889
5          3  Островский              Гроза    798
0          1    Тургенев        Отцы и дети    731
3          2       Чехов   Толстый и тонкий    615
4          2       Чехов    Дама с собачкой    459

#4

In [56]:
authors_stat = authors_price.groupby("author_name").agg( min_price=('price', np.min),max_price=('price', np.max), mean_price=('price', np.mean))
authors_stat

             min_price  max_price  mean_price
author_name
Островский         388        798       593.0
Тургенев           429        889       683.0
Чехов              459        615       537.0

#5

In [57]:
authors_price["cover"] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    731  твердая
1          1    Тургенев                 Рудин    429   мягкая
2          1    Тургенев     Дворянское гнездо    889   мягкая
3          2       Чехов      Толстый и тонкий    615  твердая
4          2       Чехов       Дама с собачкой    459  твердая
5          3  Островский                 Гроза    798   мягкая
6          3  Островский  Таланты и поклонники    388   мягкая

In [58]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'], columns=['cover'], aggfunc=np.sum,fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский     1186        0
Тургенев       1318      731
Чехов             0     1074

In [60]:
pd.to_pickle(book_info,"./lesson_2/book_info.pkl")

In [62]:
book_info2 = pd.read_pickle("./lesson_2/book_info.pkl")
book_info2

cover        мягкая  твердая
author_name
Островский     1186        0
Тургенев       1318      731
Чехов             0     1074

In [63]:
book_info.compare(book_info2)

Empty DataFrame
Columns: []
Index: []